#+TITLE: Gradebook
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+STARTUP: showeverything entitiespretty

  On the master branch you may edit this file locally, but the grading branch on
  Github will contain your official scores, and these sensitive numbers, along
  with your Final Grade, will be encrypted with your public key in a
  to-be-revealed way.

* Final Grade                                                         :crypt:
  :PROPERTIES:
  :CRYPTKEY: lef13001@byui.edu
  :END:
:FINAL_GRADE:
:END:

** Scores
#+tblname: grades-as-table
| Grade Item      | Raw Score | Timeliness | Weight | Weighted Score | Date Due               |
|-----------------+-----------+------------+--------+----------------+------------------------|
| [[file:week00/00-prepare.org][00 Prepare]]      |    100.00 |       1.00 |    0.1 |            0.1 | <2018-04-26 Thu 18:00> |
| [[file:week00/00-teach.org][00 Teach]]        |    100.00 |       1.00 |    0.2 |            0.2 | <2018-04-27 Fri 18:00> |
| [[file:week00/00-ponder-prove.org][00 Ponder/Prove]] |    100.00 |       1.00 |    2.5 |            2.5 | <2018-04-30 Mon 18:00> |
| [[file:week01/01-prepare.org][01 Prepare]]      |    100.00 |       1.00 |    0.3 |            0.3 | <2018-05-02 Wed 18:00> |
| [[file:week01/01-teach.org][01 Teach]]        |    100.00 |       1.00 |    1.9 |            1.9 | <2018-05-04 Fri 18:00> |
| [[file:week01/01-ponder-prove.org][01 Ponder/Prove]] |    100.00 |       1.00 |    2.5 |            2.5 | <2018-05-07 Mon 18:00> |
| [[file:week02/02-prepare.org][02 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-05-09 Wed 18:00> |
| [[file:week02/02-teach.org][02 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-05-11 Fri 18:00> |
| [[file:week02/02-ponder-prove.org][02 Ponder/Prove]] |    100.00 |       1.00 |    3.0 |             3. | <2018-05-14 Mon 18:00> |
| [[file:week03/03-prepare.org][03 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-05-16 Wed 18:00> |
| [[file:week03/03-teach.org][03 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-05-18 Fri 18:00> |
| [[file:week03/03-ponder-prove.org][03 Ponder/Prove]] |    100.00 |       1.00 |    3.5 |            3.5 | <2018-05-21 Mon 18:00> |
| [[file:week04/04-prepare.org][04 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-05-23 Wed 18:00> |
| [[file:week04/04-teach.org][04 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-05-25 Fri 18:00> |
| [[file:week04/04-ponder-prove.org][04 Ponder/Prove]] |    100.00 |       1.00 |    4.0 |             4. | <2018-05-29 Tue 18:00> |
| [[file:week05/05-prepare.org][05 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-05-30 Wed 18:00> |
| [[file:week05/05-teach.org][05 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-06-01 Fri 18:00> |
| [[file:week05/05-ponder-prove.org][05 Ponder/Prove]] |    100.00 |       1.00 |    4.5 |            4.5 | <2018-06-04 Mon 18:00> |
| [[file:week06/06-prepare.org][06 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-06-06 Wed 18:00> |
| [[file:week06/06-teach.org][06 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-06-08 Fri 18:00> |
| [[file:week06/06-ponder-prove.org][06 Ponder/Prove]] |    100.00 |       1.00 |    5.0 |             5. | <2018-06-11 Mon 18:00> |
| [[file:week07/07-prepare.org][07 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-06-13 Wed 18:00> |
| [[file:week07/07-teach.org][07 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-06-15 Fri 18:00> |
| [[file:week07/07-ponder-prove.org][07 Ponder/Prove]] |    100.00 |       1.00 |    5.5 |            5.5 | <2018-06-18 Mon 18:00> |
| [[file:week08/08-prepare.org][08 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-06-20 Wed 18:00> |
| [[file:week08/08-teach.org][08 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-06-22 Fri 18:00> |
| [[file:week08/08-ponder-prove.org][08 Ponder/Prove]] |    100.00 |       1.00 |    6.0 |             6. | <2018-06-25 Mon 18:00> |
| [[file:week09/09-prepare.org][09 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-06-27 Wed 18:00> |
| [[file:week09/09-teach.org][09 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-06-29 Fri 18:00> |
| [[file:week09/09-ponder-prove.org][09 Ponder/Prove]] |    100.00 |       1.00 |    7.0 |             7. | <2018-07-02 Mon 18:00> |
| [[file:week10/10-prepare.org][10 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-07-05 Thu 18:00> |
| [[file:week10/10-teach.org][10 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-07-06 Fri 18:00> |
| [[file:week10/10-ponder-prove.org][10 Ponder/Prove]] |    100.00 |       1.00 |    8.0 |             8. | <2018-07-09 Mon 18:00> |
| [[file:week11/11-prepare.org][11 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-07-11 Wed 18:00> |
| [[file:week11/11-teach.org][11 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-07-13 Fri 18:00> |
| [[file:week11/11-ponder-prove.org][11 Ponder/Prove]] |    100.00 |       1.00 |    8.5 |            8.5 | <2018-07-16 Mon 18:00> |
| [[file:week12/12-prepare.org][12 Prepare]]      |    100.00 |       1.00 |    0.5 |            0.5 | <2018-07-18 Wed 18:00> |
| [[file:week12/12-teach.org][12 Teach]]        |    100.00 |       1.00 |    2.0 |             2. | <2018-07-20 Fri 18:00> |
| [[file:week12/12-ponder-prove.org][12 Ponder/Prove]] |    100.00 |       1.00 |   10.0 |            10. | <2018-07-23 Mon 18:00> |
#+tblfm: $5=$2*$3*$4/100   

* What If Calculator
  If you want to use this file as a what if calculator, follow these steps:

  1. Edit the values you want to in the preceding table.
  2. Put your cursor on the "#+tblfm:" line, then type ", ,".
  3. Put your cursor somewhere in the code block below, then type ", ,".
  4. Your "what if" grade will be displayed at the bottom of the file.

#+NAME: compute-final-grade
#+BEGIN_SRC emacs-lisp :var grades=grades-as-table
  (setq weighted-percentage (apply '+ (mapcar 'fifth grades))
        number (ceiling weighted-percentage)
        tensDigit (/ number 10)
        onesDigit (mod number 10)
        index (min (max (- tensDigit 5) 0) 4)
        letter (substring "FDCBA" index (+ index 1))
        sign (if (<= onesDigit 2) "-" (if (>= onesDigit 7) "+"))
        letter-grade (concat letter (if (and (< number 95) (>= number 60)) sign))
        both (list (format "%2.2f" weighted-percentage) letter-grade))

#+END_SRC

#+RESULTS: compute-final-grade
| 100.00 | A |
